//  Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).
//4 -> да      -3 -> нет     7 -> нет

int n= 7; // число 
Console.WriteLine(n % 2== 0 ? "Да" : "Нет");

Console.ReadLine();
